app/Controllers/Home.php

    public function detail($slug)
    {
        $query = $this->product->getWhere(['slug' => $slug])->getRow();

        $product_id = $query->id;

        $data = [
            'product' => $query,
            'brand' => $this->brand->findAll(),
            'discount' => $this->discount->findAll(),
            'size' => $this->size->where('product_id', $product_id)->get()->getResultArray(),
            'color' => $this->color->where('product_id', $product_id)->get()->getResultArray(),
---
SELECT *
FROM `product`
WHERE `slug` = 'crewneck-champions'
SELECT *
FROM `discount`
SELECT *
FROM `size`
WHERE `product_id` = '28'
SELECT *
FROM `color`
WHERE `product_id` = '28'

    public function addCart()
    {
        if (!session('id')) {
            return redirect()->to(site_url('masuk'));
        }

        $doValid = $this->validate([
            'size' => [
                'label' => 'Ukuran',
                'rules' => 'required',
                'errors' => [
                    'required' => '{field} tidak boleh kosong',
                ]
            ],
            'color' => [
                'label' => 'Warna',
                'rules' => 'required',
                'errors' => [
                    'required' => '{field} tidak boleh kosong',
                ]
            ],
        ]);

        if (!$doValid) {
            $slug = $this->request->getVar('slug');
            $query = $this->product->getWhere(['slug' => $slug])->getRow();
---
SELECT *
FROM `product`
WHERE `slug` = 'crewneck-champions'

            $data = [
                'product' => $query,
                'brand' => $this->brand->findAll(),
                'discount' => $this->discount->findAll(),
                'size' => $this->size->where('product_id', $product_id)->get()->getResultArray(),
                'color' => $this->color->where('product_id', $product_id)->get()->getResultArray(),
---
SELECT *
FROM `discount`
SELECT *
FROM `size`
WHERE `product_id` = '28'
SELECT *
FROM `color`
WHERE `product_id` = '28'