app/Controllers/Home.php

    public function profile($username)
    {
        $data['user'] = $this->profile->getWhere(['username' => $username])->getRow();
---
SELECT *
FROM `user`
WHERE `username` = 'user'

            'modified_at' => Time::now('Asia/Jakarta', 'en_ID')
        ];

        $this->db->table('user')->where(['username' => $username])->update($params);
---
UPDATE `user` SET `first_name` = 'User', `last_name` = '', `telephone` = '081233434392', `email` = 'user@gmail.com', `image` = 'user_6.png', `modified_at` = '2022-08-09 13:56:34'
WHERE `username` = 'user'